export const Core = [
  `1. ทำไมน้องถึงเลือกสมัครเข้ามาในสาขานี้ และในอีก 10 ปีข้างหน้า น้องจินตนาการภาพที่ตนเองได้ทำงานในสาขาที่เลือกว่าเป็นอย่างไร`,
  `2. ถ้าน้อง ๆ ย้อนเวลากลับไปอยู่ในยุคกรีก น้อง ๆ อยากให้ยุคนั้นมีเว็บไซต์อะไร เพราะอะไร`,
  `3. สมมติว่าน้องได้รับมอบหมายให้รับผิดชอบงานกลุ่ม แล้วมีเพื่อนสนิทที่อยู่ในกลุ่มไม่เคยมาช่วยทำงานเลย พอน้องไปถามเพื่อน ก็พบว่าเพื่อนต้องช่วยทำงานแบ่งเบาภาระที่บ้านทุกวัน น้องจะรู้สึกอย่างไรและจะแก้ไขปัญหานี้อย่างไร เพื่อให้เพื่อนคนนั้นยังได้ทำงานและอยู่ในกลุ่มได้`,
]

// NOTE: majorAnswer3 must be appended to majorAnswer2
export const Content = [
  `1. สมมติหากเกศสุรางค์ไม่ได้ย้อนเวลากลับไปในยุคอยุธยา แต่กลับไปในอยู่ในยุคกรีก คิดว่าเกศสุรางค์จะได้ไปพบเทพองค์ใด แล้วจะเกิดเหตุการณ์อะไรขึ้นบ้าง และสุดท้ายแม่การะเกดจะสามารถกลับมาโลกปัจจุบันได้หรือไม่ อย่างไร ลองเล่าให้พี่ฟังหน่อย`,
  `2. คำว่า Thailand 4.0 ในมุมมองของน้องคืออะไร อธิบาย และยกตัวอย่าง (กำหนดให้ไม่เกิน 1000 ตัวอักษร)`,
]

export const Designer = [
  `1. ถ้าหากเทพเจ้าฮาเดท มากล่าวหาว่างานดีไซน์เว็บของน้องมันไม่ถูกใจประชาชนในดินแดนนรกที่ไม่คุ้นชิ้นกับแสงสว่างและสีสันสดใสของเขา แต่น้องมั่นใจว่างานดีไซน์เว็บของน้องถูกใจทวยเทพและประชาชนบนโลกที่รักในแสงสว่างและความสดใส น้องจะอธิบายต่อเทพเจ้าฮาเดทว่าอย่างไร`,
  `2. ถ้าจะบอกนิสัยของตนเองผ่านสี สีนั้นจะเป็นสีอะไร เพราะอะไร อันนี้คือไม่จำกัดสีนะ เป็น hex code มาเลยก็ได้`,
  `3. หากน้องข้ามพิภพไปอยู่ในยุคกรีก ในร่างของเทพ ร่างนั้นจะมีหน้าตาเป็นอย่างไร และมีความสามารถอะไรที่เป็นพิเศษมากกว่าเทพทั่วไป (ครีเอทภาพมาให้พี่ๆดูหน่อย ด้วยวิธีใดๆก็ได้ในโลก)`,
]

export const Creative = [
  `1. น้องคิดว่า Facebook Page, Twitter และ Line Official แตกต่างกันอย่างไร พร้อมยกตัวอย่าง`,
  `2. เทพเจ้ามากมายต่างรวมกัน ณ กรุงเอเธนส์แห่งนี้ ไม่ว่าจะเป็น
  เทพเจ้าโพไซดอน อายุ 60 ปี ผู้หลงรักน้ำทะเลยิ่งกว่าสิ่งใด
  เทพีอะธีนา อายุ 55 ปี ผู้เฉลียวฉลาด และเป็นนักวิเคราะห์วางแผน
  เทพเจ้าเฮอร์มีส อายุ 35 ปี ผู้ช่างพูดช่างคุย และมักได้รับภารกิจเดินทางไปต่างเมืองอยู่เสมอ
  เทพีวีนัสหรืออโฟรไดท์ อายุ 25 ปี ผู้รักสวยรักงามเป็นที่หนึ่ง
  เทพเจ้ามาร์ส อายุ 17 ปี นักสู้ผู้ยิ่งใหญ่ ที่ต้องคอยฝึกฝนตัวเองอย่างหนัก
  ให้น้องหาสินค้าหรือบริการอะไรก็ได้มาหนึ่งอย่าง โดยให้เหมาะสมกับเทพเจ้าสององค์ น้องสามารถหาสินค้า/บริการที่เคยมีอยู่หรือที่น้องคิดขึ้นมาเอง พร้อมอธิบายเหตุผลให้ครบ`,
  `3. แม่การะเกดต้องการจะขายน้ำปลาหวาน แต่พบว่ามีคู่แข่งน้ำปลาหวานเป็นจำนวนมาก น้องจะมีวิธีอย่างไรที่ทำให้แบรนด์ของแม่การะเกดนั้นขายได้ดีกว่าเจ้าอื่น ๆ แล้วน้องจะโปรโมทผ่านทางไหนบ้าง โดยน้องสามารถนำสินค้าไปเล่นกับกระแสในช่วงนี้ได้เต็มที่ `,
]

export const Developer = [
  `1. วันหนึ่งเทพซุสเดินเข้าป่า ท่านเจอนกตัวหนึ่ง มันถามท่านว่า “จะไปไหน” ท่านจึงตอบ ”อยากไปให้ไกล ไกลเกินกว่าที่ฉันเคยไป”
  ถ้านกสามารถถามเทพซุสว่า “ท่านจะเดินทางไปไกล x เมตรใช่หรือไม่” (กำหนดให้ x แทนจำนวนจริงใดๆ) ได้กี่ครั้งก็ได้
  โดยเทพซุสสามารถตอบนกได้เพียงแค่ “มากไป” “น้อยไป” หรือ “ถูกต้อง” เท่านั้น

  ให้น้องๆ ช่วยนกคิดวิธีในการถามเทพซุสเพื่อที่จะได้คำตอบว่า ”ถูกต้อง” โดยใช้จำนวนครั้งในการถามน้อยที่สุดเท่าที่จะทำได้

  อธิบายวิธีการของน้องๆและบอกว่าถ้าหากใช้วิธีของน้องในการถามเทพซุส จะสามารถการันตีได้ว่า จะได้คำตอบในการถามไม่เกินกี่ครั้ง
  (ไม่รวมจำนวนครั้งที่ถามว่าจะไปไหน และเทพซุสจะเดินทางไปเป็นระยะเท่ากับจำนวนเต็มบวกที่ไม่เกิน 74,520 เมตร เท่านั้น)`,
  `2. วันหนึ่งเทพซุสเดินเข้าป่า ท่านเจอเสือตัวใหญ่ มันถามท่านว่า “ท่านว่างไหม” ท่านจึงตอบว่า “ไม่เท่าไหร่ ยังดีกว่าคนไร้หัวใจ” เสือจึงชวนเทพซุสคุยเล่นดังนี้ “กำหนดให้ในป่านี้ คนบางคนใจร้าย คนบางคนไร้หัวใจ และ คนไร้หัวใจทุกคนใจร้าย” จากข้อมูลข้างต้น หากเราสรุปว่า “คนใจร้ายทุกคนไร้หัวใจ” ได้หรือไม่ จงอธิบาย`,
  `3. จงออกแบบเว็บตามรูปที่กำหนดให้ โดยสามารถแก้ไขคำ หรือออกแบบเพิ่มเติมได้อย่างเต็มที่ ไม่จำกัดไอเดีย (สามารถเขียน CSS, JS เพิ่มเติมได้ (ถ้าเขียนได้)) น้องๆ สามารถแปะโค้ด HTML ลงไปในนี้ได้เลย หรือจะแปะลิงค์ Public Repository ก็ได้`,
]

export default {
  core: Core,
  content: Content,
  designer: Designer,
  creative: Creative,
  developer: Developer,
}
