export const Core = [
  '1. ถ้าน้องถูกจารึกไว้ในประวัติศาสตร์ว่าเป็นบุคคลสำคัญ น้องคิดว่าตัวเองควรถูกจารึกไว้ในด้านใด ด้วยเหตุผลอะไร ?วทย์มนต์แห่งการท่องกาลเวลา สามารถย้อนเวลากลับไปในอดีตและเดินทางไปยังโลกอนาคตได้ น้องจะใช้ความสามารถนี้ในการแก้ปัญหาด้านความเหลื่อมล้ำทางการศึกษาไทยที่เกิดขึ้นในปัจจุบันได้อย่างไร',
  '2. ถ้าน้องต้องการแก้ปัญหาเรื่องฝุ่น PM2.5 น้องคิดว่าการแก้ปัญหาต้องเริ่มที่ภาคประชาชนหรือภาครัฐ เพราะเหตุผลอะไร และน้องจะเสนอแนวทางการแก้ปัญหานี้อย่างไร ?',
  '3. มีเรื่องอะไรที่น้องรู้สึกว่ามันแย่มากๆ ไม่สมควรเกิดขึ้นเลย! แต่ตัวน้องกลับไม่สามารถทำอะไรเลย เล่ามาให้ฟังหน่อย จะเป็นประสบการณ์ส่วนตัวหรือเรื่องสังคมก็ได้ ถ้าหากน้องมีโอกาสแก้ไข น้องจะทำอย่างไร ?'
]

// NOTE: majorAnswer3 must be appended to majorAnswer2
export const Design = [
  `1. ให้น้องลองออกแบบโลโก้ค่าย YCC ขึ้นมาใหม่ในแบบของน้อง (สามารถถ่ายภาพวาดบนกระดาษ หรือ ออกแบบบนโปรแกรมต่าง ๆ ได้) พร้อมอธิบายแนวคิดในการออกแบบโลโก้นี้ โดยสามารถดาวน์โหลดไฟล์โลโก้ปัจจุบันได้ ที่นี่`,
  `2. เคยรู้จักคำว่า Universal Design (ผลิตภัณฑ์ที่ใช้ได้กับทุกเพศทุกวัย) ไหม? ลองอธิบายความหมาย และยกตัวอย่างผลิตภัณฑ์ พร้อมอธิบายว่าทำไมมันจึงถูกออกแบบมาเช่นนี้ ในความคิดของตนเอง`,
]

export const Developer = [
  `1. ลองออกแบบระบบที่น้องๆ คิดว่าสามารถช่วยให้การเดินทางด้วยระบบขนส่งสาธารณะดียิ่งขึ้น ไม่ว่าจะเป็น แท็กซี่ รถเมล์ รถไฟฟ้า รถไฟ หรือเครื่องบิน และจะใช้เทคโนโลยีอะไรในการแก้ปัญหานี้ได้บ้าง`,
  `2. ลองเขียนโปรแกรมเพื่อแนะนำตัวเองสั้นๆ ในรูปแบบใดๆ ก็ได้ ไม่ว่าจะเป็นเว็บไซต์, โปรแกรม command line หรือรูปแบบอื่นๆ ตามที่ต้องการ`
]

export const Creative = [
  `1. ปัจจุบันโลกของเรากำลังเผชิญกับปัญหาในหลาย ๆ ด้าน ไม่ว่าจะเป็น ภัยพิบัติธรรมชาติ เศรษฐกิจ หรือด้านอื่น ๆ อีกมากมาย น้องมีวิธีการที่จะส่งเสริมให้ผู้คนตระหนักถึงเรื่องเหล่านี้มากขึ้นได้อย่างไร ?`,
  `2. ถ้าน้องเป็นนักวิทยาศาสตร์ที่รู้วิธีการรักษาของ "ไวรัสโคโรนา" และเมื่อนำเสนอวิธีการรักษานี้ออกไป ประชาชนกลับมองว่าเป็นวิธีการที่ไม่น่าเชื่อถือ น้องจะมีวิธีการหรือไอเดียในการสร้างความน่าเชื่อถือได้อย่างไร ?`
]

export default {
  core: Core,
  designer: Design,
  developer: Developer,
}
